# Подключаем зависимости

# Меняет переменную с текущим игроком O --> X или наоборот
def change_player():
    ...


# START GAME

# Выводим доску лидеров

# Запрашиваем НИК для х
# Запрашиваем НИК для о


# Переменная для текущего игрока. Чередуется после каждого хода

# Переменная для Х или О для текущего игрока


# MAIN GAME LOOP

    # Выводится поле
    
    # Запрос хода (х | о)

    # Проверяем 1-ый и 2-ой символы на правильность

    # Проверяем пустая ли клетка, куда игрок хочет походить

    # Ход игрока

    # Проверка выйгрыша

    # Если кто-то выиграл, то выводим победителя и завершаем игру

    # Смена игрока

# Определяем победителя
    # сохраняем результаты
